File Name: 015_HW_introToPandas.ipynb

Series Exercises:

1. Create a Series:

In [3]:
import pandas as pd

fruits = pd.Series(['apple', 'banana', 'cherry', 'date'], index = ['a', 'b', 'c', 'd'])

In [4]:
print(fruits)

a     apple
b    banana
c    cherry
d      date
dtype: object

In [9]:
print(fruits.index)
# to get the index : series.index
# to get the value: series.values

Index(['a', 'b', 'c', 'd'], dtype='object')

2. Accessing Elements:

In [11]:
print(fruits["b"])

banana

3. Series Operations:

In [16]:
square_series = pd.Series([i ** 2 for i in range(1,6)])
square_series = square_series.add(10)

In [17]:
square_series

0    11
1    14
2    19
3    26
4    35
dtype: int64

DataFrame Exercises:

1. Create a DataFrame:

In [39]:
'''Question ???
data = [
    {"Name" : "Sophia", "Age" : 22, "Grade" : "A"},
    {"Name" : "Sherry", "Age" : 21, "Grade" : "A"},
    {"Name" : "Yilin", "Age" : 23, "Grade" : "A"}
]

data = [
    {"Name": ["Sophia","Sherry","Yilin"]},
    {"Age" : [22,21,23]},
    {"Grade" : ["A","A","A"]}
]
'''
# Method 1
data = {"Name": ["Sophia","Sherry","Yilin"],
        "Age" : [22,21,23],
        "Grade" : ["A","A","A"]
}

students = pd.DataFrame(data)

'''
# Method 2
data = [["Sophia",22,"A"],
       ["Sherry",21,"A"],
       ["Yilin",23,"A"]]

students = pd.DataFrame(data, columns = ["Name", "Age", "Grade"])
'''
#print(students)
#print(type(data))
students

     Name  Age Grade
0  Sophia   22     A
1  Sherry   21     A
2   Yilin   23     A

2. Accessing Data:

In [40]:
print(students["Name"])

0    Sophia
1    Sherry
2     Yilin
Name: Name, dtype: object

3. DataFrame Operations:

In [41]:
students["Graduated"] = students["Grade"].apply(lambda x: True if x == "A" else False)

In [42]:
print(students)

     Name  Age Grade  Graduated
0  Sophia   22     A       True
1  Sherry   21     A       True
2   Yilin   23     A       True

In [43]:
students

     Name  Age Grade  Graduated
0  Sophia   22     A       True
1  Sherry   21     A       True
2   Yilin   23     A       True

4. Maths:

In [44]:
students["Age"].mean()

22.0

5. Sorting:

In [47]:
students.sort_values("Age", ascending = False)

     Name  Age Grade  Graduated
2   Yilin   23     A       True
0  Sophia   22     A       True
1  Sherry   21     A       True

6. Tidy Data:

In [56]:
data = [[10,2,5,3],
       [15,4,9,6],
       [18,7,12,9],
       [13,2,7,4]]

col_name = ["Happiness", "Language", "Energy", "Memory"]
row_name = ["subject1", "subject2", "subject3", "subject4"]
cognitive_heatlh_df = pd.DataFrame(data, columns = col_name, index = row_name)
cognitive_heatlh_df

          Happiness  Language  Energy  Memory
subject1         10         2       5       3
subject2         15         4       9       6
subject3         18         7      12       9
subject4         13         2       7       4

Some Notes for :
How to check arguments in function quickly in JupyterNotebook

Method 1: pd.DataFrame? 

Method 2 : help(pd.DataFrame)

In [58]:

cognitive_heatlh_df.mean()

Happiness    14.00
Language      3.75
Energy        8.25
Memory        5.50
dtype: float64

In [60]:
cognitive_heatlh_df["Happiness"].mean()

14.0

In [61]:
cognitive_heatlh_df["Happiness"].std()

3.366501646120693